recipe_manager/app/views/recipe_ingredients/_form.html.erb

SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."title" ASC
---
    <%= form.label :step_id, "Step", style: "display: block" %>
    <%= form.collection_select :step_id, @steps, :id, ->(step) { "#{step.recipe.title} - #{step.order}. #{step.title.presence || step.action.truncate(50)}" }, prompt: "No specific step" %>