recipe_manager/app/views/recipe_ingredients/_recipe_ingredient.html.erb

SELECT "steps".* FROM "steps" WHERE "steps"."id" = 21 LIMIT 1
---
    <strong>Step:</strong>
    <%= recipe_ingredient.step ? "#{recipe_ingredient.step.order}. #{recipe_ingredient.step.title.presence || recipe_ingredient.step.action.truncate(50)}" : "None" %>