recipe_manager/app/services/nested_recipe_importer.rb

  def create_recipe
    Recipe.create!(
      title: data.fetch("title"),
      version: data.fetch("version"),
      language: data["language"],
      diet: array_text(data["diet"]),
      tags: array_text(data["tags"]),
      equipment: array_text(data["equipment"]),
      nutrition_notes: array_text(data["nutrition_notes"]),
      servings_count: dig_value("servings", "count"),
      servings_unit: dig_value("servings", "unit"),
      yield_amount: dig_value("yield", "amount"),
      yield_unit: dig_value("yield", "unit"),
      yield_description: dig_value("yield", "description"),
      source_created_from: dig_value("source_context", "created_from"),
      source_notes: dig_value("source_context", "notes")
    )
---
INSERT INTO "recipes" ("stable_id", "title", "version", "language", "diet", "tags", "equipment", "nutrition_notes", "servings_count", "servings_unit", "yield_amount", "yield_unit", "yield_description", "source_created_from", "source_notes", "created_at", "updated_at") VALUES ('soy-curl-encacahuatado', 'Soy Curl Encacahuatado', '1.0', 'en', 'vegan', 'mexican; soy curls; peanut sauce; main course; stovetop', 'blender; skillet; saucepan; strainer', 'High-protein vegan main dish.; Peanut-based sauce is calorie-dense.', 3.0, 'people', 900.0, 'g', 'saucy main dish', 'chat', 'Designed for soy curls, dried chiles, and a thick peanut-based sauce.', '2026-05-02 00:22:14.744657', '2026-05-02 00:22:14.744657') RETURNING "id"

  def create_ingredients(recipe)
    inferred_step_counts = Hash.new(0)

    Array(data["ingredients"]).each do |item|
      ingredient = Ingredient.find_or_create_by!(name: item.fetch("name"))
      recipe.recipe_ingredients.create!(
        ingredient: ingredient,
        step: step_for(recipe, item, inferred_step_counts),
        amount: item["amount"]&.to_s,
        unit: item["unit"],
        state: item["state"],
        preparation: item["preparation"],
        section: item["section"],
        optional: item["optional"],
        notes: item["notes"]
      )
---
INSERT INTO "ingredients" ("name", "created_at", "updated_at") VALUES ('onion', '2026-05-02 01:27:49.353263', '2026-05-02 01:27:49.353263') RETURNING "id"
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."name" = 'salt' LIMIT 1
INSERT INTO "recipe_ingredients" ("recipe_id", "ingredient_id", "amount", "unit", "state", "preparation", "section", "optional", "notes", "created_at", "updated_at", "step_id") VALUES (9, 13, '0.25', 'tsp', NULL, NULL, 'seitan dough', TRUE, NULL, '2026-05-02 01:47:29.942888', '2026-05-02 01:47:29.942888', 31) RETURNING "id"

  def create_steps(recipe)
    Array(data["steps"]).each do |item|
      recipe.steps.create!(
        order: item.fetch("order"),
        title: item["title"],
        action: item.fetch("action"),
        time_amount: item.dig("time", "amount")&.to_s,
        time_unit: item.dig("time", "unit"),
        time_per_side: item.dig("time", "per_side"),
        time_description: item.dig("time", "description"),
        temperature_amount: item.dig("temperature", "amount"),
        temperature_unit: item.dig("temperature", "unit"),
        temperature_description: item.dig("temperature", "description"),
        heat_level: item["heat_level"],
        targets: array_text(item["targets"]),
        risk_points: array_text(item["risk_points"]),
        notes: array_text(item["notes"]),
        optional_data: item["optional"]&.to_json
      )
---
INSERT INTO "steps" ("recipe_id", "order", "title", "action", "time_amount", "time_unit", "time_per_side", "time_description", "temperature_amount", "temperature_unit", "temperature_description", "heat_level", "targets", "risk_points", "notes", "optional_data", "created_at", "updated_at") VALUES (8, 2, 'Toast the chiles', 'Briefly toast dried chiles on a dry skillet until fragrant, avoiding blackening.', '20', 'sec', TRUE, NULL, NULL, NULL, NULL, NULL, 'aromatic; slightly darkened; not bitter', 'Burned chiles make the sauce bitter.', '', NULL, '2026-05-02 01:47:29.821482', '2026-05-02 01:47:29.821482') RETURNING "id"

  def create_technique_notes(recipe)
    Array(data["technique_notes"]).each do |item|
      recipe.technique_notes.create!(topic: item.fetch("topic"), note: item.fetch("note"))
---
INSERT INTO "technique_notes" ("recipe_id", "topic", "note", "created_at", "updated_at") VALUES (7, 'Repeated ingredients', 'The three salt entries intentionally omit step_order so the importer maps each usage to the matching step in order.', '2026-05-02 01:27:49.361000', '2026-05-02 01:27:49.361000') RETURNING "id"

  def create_substitutions(recipe)
    Array(data["substitutions"]).each do |item|
      substitution = recipe.substitutions.create!(ingredient: item.fetch("ingredient"))

      Array(item["substitutes"]).each do |substitute|
        substitution.substitutes.create!(
          name: substitute.fetch("name"),
          ratio: substitute["ratio"],
          effect: substitute["effect"]
        )
---
INSERT INTO "substitutions" ("recipe_id", "ingredient", "created_at", "updated_at") VALUES (8, 'guajillo chiles', '2026-05-02 01:47:29.873462', '2026-05-02 01:47:29.873462') RETURNING "id"
INSERT INTO "substitutes" ("substitution_id", "name", "ratio", "effect", "created_at", "updated_at") VALUES (7, 'ancho chile', '1:1', 'sweeter, darker, less bright', '2026-05-02 01:47:29.875898', '2026-05-02 01:47:29.875898') RETURNING "id"

  def create_adjustments(recipe)
    Array(data["adjustments"]).each do |item|
      recipe.adjustments.create!(condition: item.fetch("condition"), fix: item.fetch("fix"))
---
INSERT INTO "adjustments" ("recipe_id", "condition", "fix", "created_at", "updated_at") VALUES (8, 'sauce too thick', 'Add hot water or broth 1 tbsp at a time.', '2026-05-02 01:47:29.882274', '2026-05-02 01:47:29.882274') RETURNING "id"

  def create_storage(recipe)
    storage = data["storage"]
    return unless storage

    recipe.create_storage!(
      refrigerator_duration: storage.dig("refrigerator", "duration"),
      refrigerator_unit: storage.dig("refrigerator", "unit"),
      freezer_duration: storage.dig("freezer", "duration"),
      freezer_unit: storage.dig("freezer", "unit"),
      reheat: storage["reheat"]
    )
---
INSERT INTO "storages" ("recipe_id", "refrigerator_duration", "refrigerator_unit", "freezer_duration", "freezer_unit", "reheat", "created_at", "updated_at") VALUES (8, 4.0, 'days', 2.0, 'months', 'Reheat gently with a splash of water.', '2026-05-02 01:47:29.888470', '2026-05-02 01:47:29.888470') RETURNING "id"

  def step_for(recipe, item, inferred_step_counts)
    if item["step_order"].present?
      return recipe.steps.find_by(order: item["step_order"])
---
SELECT "steps".* FROM "steps" WHERE "steps"."recipe_id" = 8 AND "steps"."order" = 1 ORDER BY "steps"."order" ASC LIMIT 1