recipe_manager/app/controllers/adjustments_controller.rb

  def index
    @adjustments = Adjustment.all
---
SELECT "adjustments".* FROM "adjustments"

  def create
    @adjustment = Adjustment.new(adjustment_params)

    if @adjustment.save
---
INSERT INTO "adjustments" ("condition", "created_at", "fix", "recipe_id", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["condition", "MyText"], ["created_at", "2026-05-01 23:43:51.430827"], ["fix", "MyText"], ["recipe_id", 980190962], ["updated_at", "2026-05-01 23:43:51.430827"]]

  def destroy
    @adjustment.destroy!
---
DELETE FROM "adjustments" WHERE "adjustments"."id" = ?  [["id", 980190962]]

    def set_adjustment
      @adjustment = Adjustment.find(params.expect(:id))
---
SELECT "adjustments".* FROM "adjustments" WHERE "adjustments"."id" = 1 LIMIT 1