recipe_manager/app/controllers/application_controller.rb

  def load_recipe_progress_state(recipe)
    @recipe = recipe
    @recipe_ingredients = recipe.recipe_ingredients.left_joins(:step).joins(:ingredient).preload(:ingredient, :step).order("steps.\"order\"", :section, "ingredients.name")
    @steps = recipe.steps.order(:order)
    @procured_recipe_ingredient_ids = RecipeIngredientProgress.where(
      recipe_ingredient: recipe.recipe_ingredients,
      user_key: current_progress_user_key
    ).pluck(:recipe_ingredient_id).to_set
    @done_step_ids = StepProgress.where(
      step: recipe.steps,
      user_key: current_progress_user_key
    ).pluck(:step_id).to_set
---
SELECT "recipe_ingredient_progresses"."recipe_ingredient_id" FROM "recipe_ingredient_progresses" WHERE "recipe_ingredient_progresses"."recipe_ingredient_id" IN (SELECT "recipe_ingredients"."id" FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = 6) AND "recipe_ingredient_progresses"."user_key" = '6db8c447-5611-4bfa-9911-12ca39110cd8'
SELECT "step_progresses"."step_id" FROM "step_progresses" WHERE "step_progresses"."step_id" IN (SELECT "steps"."id" FROM "steps" WHERE "steps"."recipe_id" = 6 ORDER BY "steps"."order" ASC) AND "step_progresses"."user_key" = '6db8c447-5611-4bfa-9911-12ca39110cd8'