recipe_manager/app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients" ORDER BY "ingredients"."name" ASC
---
  def index
    @ingredients = Ingredient.order(:name)

INSERT INTO "ingredients" ("created_at", "name", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["created_at", "2026-05-01 23:56:43.885932"], ["name", "Butter"], ["updated_at", "2026-05-01 23:56:43.885932"]]
---
  def create
    @ingredient = Ingredient.new(ingredient_params)

    if @ingredient.save

DELETE FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", 980190962]]
---
  def destroy
    @ingredient.destroy!

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = 1 LIMIT 1
---
    def set_ingredient
      @ingredient = Ingredient.find(params.expect(:id))