recipe_manager/app/controllers/recipes_controller.rb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" IN (?, ?)  [["recipe_id", 298486374], ["recipe_id", 980190962]]
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" IN (2, 1)
SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."title" ASC
SELECT "steps".* FROM "steps" WHERE "steps"."recipe_id" IN (2, 1) ORDER BY "steps"."order" ASC
---
  def index
    @recipes = Recipe.includes(:recipe_ingredients, :steps).order(:title)

SELECT "technique_notes".* FROM "technique_notes" WHERE "technique_notes"."recipe_id" = 1 ORDER BY "technique_notes"."topic" ASC
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN (1, 2)
SELECT "substitutes".* FROM "substitutes" WHERE "substitutes"."substitution_id" IN (1, 2)
SELECT "substitutions".* FROM "substitutions" WHERE "substitutions"."recipe_id" = 1 ORDER BY "substitutions"."ingredient" ASC
SELECT "adjustments".* FROM "adjustments" WHERE "adjustments"."recipe_id" = 1 ORDER BY "adjustments"."condition" ASC
---
  def show
    load_recipe_progress_state(@recipe)
    @technique_notes = @recipe.technique_notes.order(:topic)
    @substitutions = @recipe.substitutions.includes(:substitutes).order(:ingredient)
    @adjustments = @recipe.adjustments.order(:condition)

INSERT INTO "recipes" ("stable_id", "title", "version", "language", "diet", "tags", "equipment", "nutrition_notes", "servings_count", "servings_unit", "yield_amount", "yield_unit", "yield_description", "source_created_from", "source_notes", "created_at", "updated_at") VALUES ('test', 'Test', '1', 'en', 'vegan', '', 'pan, spatula', '', 2.0, '1', NULL, '', '', '', '', '2026-05-02 00:33:41.927923', '2026-05-02 00:33:41.927923') RETURNING "id"
---
  def create
    @recipe = Recipe.new(recipe_params)

    if @recipe.save

UPDATE "recipes" SET "stable_id" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["stable_id", "mystring"], ["updated_at", "2026-05-02 00:03:34.331883"], ["id", 980190962]]
---
  def update
    if @recipe.update(recipe_params)

DELETE FROM "recipes" WHERE "recipes"."id" = 3
---
  def destroy
    @recipe.destroy!

SELECT "recipes".* FROM "recipes" WHERE "recipes"."stable_id" = 'weeknight-tomato-pasta' LIMIT 1
---
    def set_recipe
      @recipe = Recipe.find_by!(stable_id: params.expect(:id))