recipe_manager/app/controllers/recipe_ingredient_progresses_controller.rb

  def update
    recipe_ingredient = RecipeIngredient.find(params.expect(:recipe_ingredient_id))
    progress = RecipeIngredientProgress.find_by(recipe_ingredient:, user_key: current_progress_user_key)

    if done?
      RecipeIngredientProgress.find_or_create_by!(recipe_ingredient:, user_key: current_progress_user_key)
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN (3, 4, 7, 5, 6, 8, 9)
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."id" = 27 LIMIT 1
SELECT "recipe_ingredient_progresses".* FROM "recipe_ingredient_progresses" WHERE "recipe_ingredient_progresses"."recipe_ingredient_id" = 27 AND "recipe_ingredient_progresses"."user_key" = '97070ac3-d65b-4916-bce0-8e4ecd0712d6' LIMIT 1
INSERT INTO "recipe_ingredient_progresses" ("recipe_ingredient_id", "user_key", "created_at", "updated_at") VALUES (4, '97070ac3-d65b-4916-bce0-8e4ecd0712d6', '2026-05-02 01:36:42.512808', '2026-05-02 01:36:42.512808') RETURNING "id"
SELECT "recipe_ingredient_progresses".* FROM "recipe_ingredient_progresses" WHERE "recipe_ingredient_progresses"."recipe_ingredient_id" = 4 AND "recipe_ingredient_progresses"."user_key" = '97070ac3-d65b-4916-bce0-8e4ecd0712d6' LIMIT 1