recipe_manager/app/controllers/recipe_ingredients_controller.rb

  def index
    @recipe_ingredients = RecipeIngredient.joins(:recipe, :ingredient).left_joins(:step).preload(:recipe, :ingredient, :step).order("recipes.title", "steps.\"order\"", :section, "ingredients.name")
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN (1, 2)
SELECT "recipe_ingredients".* FROM "recipe_ingredients" INNER JOIN "recipes" ON "recipes"."id" = "recipe_ingredients"."recipe_id" INNER JOIN "ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" LEFT OUTER JOIN "steps" ON "steps"."id" = "recipe_ingredients"."step_id" ORDER BY recipes.title, steps."order", "recipe_ingredients"."section" ASC, ingredients.name
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" IN (2, 1)

  def create
    @recipe_ingredient = RecipeIngredient.new(recipe_ingredient_params)

    if @recipe_ingredient.save
---
INSERT INTO "recipe_ingredients" ("amount", "created_at", "ingredient_id", "notes", "optional", "preparation", "recipe_id", "section", "state", "step_id", "unit", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @recipe_ingredient.update(recipe_ingredient_params)
---
UPDATE "recipe_ingredients" SET "amount" = '3', "unit" = 'cups', "state" = '', "preparation" = '', "optional" = FALSE, "notes" = 'Use the appropriate amount for your rice type and cooking method. (3 cups for calrose)', "updated_at" = '2026-05-02 01:49:37.388302' WHERE "recipe_ingredients"."id" = 58

  def destroy
    recipe = @recipe_ingredient.recipe
    @recipe_ingredient.destroy!
---
DELETE FROM "recipe_ingredients" WHERE "recipe_ingredients"."id" = 56

    def set_recipe_ingredient
      @recipe_ingredient = RecipeIngredient.find(params.expect(:id))
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN (21, 14, 13, 12, 11, 10, 15, 20, 19, 7, 18, 17, 16)
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."id" = 56 LIMIT 1

    def set_form_collections
      @recipes = Recipe.order(:title)
      @ingredients = Ingredient.order(:name)
      @steps = Step.includes(:recipe).order("recipes.title", :order)
---
SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."title" ASC
SELECT "ingredients".* FROM "ingredients" ORDER BY "ingredients"."name" ASC
SELECT "steps".* FROM "steps" WHERE "steps"."id" IN (30, 31, 32, 36, 37)