recipe_manager/app/controllers/steps_controller.rb

  def index
    @steps = Step.all
---
SELECT "steps".* FROM "steps"

  def create
    @step = Step.new(step_params)

    if @step.save
---
INSERT INTO "steps" ("action", "created_at", "heat_level", "notes", "optional_data", "order", "recipe_id", "risk_points", "targets", "temperature_amount", "temperature_description", "temperature_unit", "time_amount", "time_description", "time_per_side", "time_unit", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @step.update(step_params)
---
UPDATE "steps" SET "time_amount" = '', "time_unit" = '', "time_per_side" = FALSE, "time_description" = '', "temperature_unit" = '', "temperature_description" = '', "heat_level" = '', "optional_data" = '', "updated_at" = '2026-05-02 00:24:45.391053' WHERE "steps"."id" = 5

  def destroy
    recipe = @step.recipe
    @step.destroy!
---
DELETE FROM "steps" WHERE "steps"."id" = ?  [["id", 980190962]]

    def set_step
      @step = Step.find(params.expect(:id))
---
SELECT "steps".* FROM "steps" WHERE "steps"."id" = 3 LIMIT 1