recipe_manager/app/controllers/step_progresses_controller.rb

  def update
    step = Step.find(params.expect(:step_id))
    progress = StepProgress.find_by(step:, user_key: current_progress_user_key)

    if done?
      StepProgress.find_or_create_by!(step:, user_key: current_progress_user_key)
      mark_related_ingredients_procured(step)
    else
      progress&.destroy!
---
SELECT "steps".* FROM "steps" WHERE "steps"."id" = 18 LIMIT 1
SELECT "step_progresses".* FROM "step_progresses" WHERE "step_progresses"."step_id" = 18 AND "step_progresses"."user_key" = '97070ac3-d65b-4916-bce0-8e4ecd0712d6' LIMIT 1
INSERT INTO "step_progresses" ("step_id", "user_key", "created_at", "updated_at") VALUES (18, '97070ac3-d65b-4916-bce0-8e4ecd0712d6', '2026-05-02 00:58:45.309628', '2026-05-02 00:58:45.309628') RETURNING "id"
DELETE FROM "step_progresses" WHERE "step_progresses"."id" = 1

  def mark_related_ingredients_procured(step)
    step.recipe_ingredients.each do |recipe_ingredient|
      RecipeIngredientProgress.find_or_create_by!(
        recipe_ingredient: recipe_ingredient,
        user_key: current_progress_user_key
      )
---
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."step_id" = 20
INSERT INTO "recipe_ingredient_progresses" ("recipe_ingredient_id", "user_key", "created_at", "updated_at") VALUES (29, '97070ac3-d65b-4916-bce0-8e4ecd0712d6', '2026-05-02 01:07:02.822326', '2026-05-02 01:07:02.822326') RETURNING "id"
SELECT "recipe_ingredient_progresses".* FROM "recipe_ingredient_progresses" WHERE "recipe_ingredient_progresses"."recipe_ingredient_id" = 29 AND "recipe_ingredient_progresses"."user_key" = '97070ac3-d65b-4916-bce0-8e4ecd0712d6' LIMIT 1