recipe_manager/app/controllers/storages_controller.rb

  def index
    @storages = Storage.all
---
SELECT "storages".* FROM "storages"

  def create
    @storage = Storage.new(storage_params)

    if @storage.save
---
INSERT INTO "storages" ("created_at", "freezer_duration", "freezer_unit", "recipe_id", "refrigerator_duration", "refrigerator_unit", "reheat", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def destroy
    @storage.destroy!
---
DELETE FROM "storages" WHERE "storages"."id" = ?  [["id", 980190962]]

    def set_storage
      @storage = Storage.find(params.expect(:id))
---
SELECT "storages".* FROM "storages" WHERE "storages"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]