recipe_manager/app/controllers/substitutions_controller.rb

  def index
    @substitutions = Substitution.all
---
SELECT "substitutions".* FROM "substitutions"

  def create
    @substitution = Substitution.new(substitution_params)

    if @substitution.save
---
INSERT INTO "substitutions" ("created_at", "ingredient", "recipe_id", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["created_at", "2026-05-01 23:42:45.875833"], ["ingredient", "MyString"], ["recipe_id", 980190962], ["updated_at", "2026-05-01 23:42:45.875833"]]

  def destroy
    @substitution.destroy!
---
DELETE FROM "substitutions" WHERE "substitutions"."id" = ?  [["id", 980190962]]

    def set_substitution
      @substitution = Substitution.find(params.expect(:id))
---
SELECT "substitutions".* FROM "substitutions" WHERE "substitutions"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]