recipe_manager/app/controllers/substitutes_controller.rb

  def index
    @substitutes = Substitute.all
---
SELECT "substitutes".* FROM "substitutes"

  def create
    @substitute = Substitute.new(substitute_params)

    if @substitute.save
---
INSERT INTO "substitutes" ("created_at", "effect", "name", "ratio", "substitution_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["created_at", "2026-05-01 23:43:51.820266"], ["effect", "MyText"], ["name", "MyString"], ["ratio", "MyString"], ["substitution_id", 980190962], ["updated_at", "2026-05-01 23:43:51.820266"]]

  def destroy
    @substitute.destroy!
---
DELETE FROM "substitutes" WHERE "substitutes"."id" = ?  [["id", 980190962]]

    def set_substitute
      @substitute = Substitute.find(params.expect(:id))
---
SELECT "substitutes".* FROM "substitutes" WHERE "substitutes"."id" = 1 LIMIT 1