recipe_manager/app/controllers/technique_notes_controller.rb

  def index
    @technique_notes = TechniqueNote.all
---
SELECT "technique_notes".* FROM "technique_notes"

  def create
    @technique_note = TechniqueNote.new(technique_note_params)

    if @technique_note.save
---
INSERT INTO "technique_notes" ("created_at", "note", "recipe_id", "topic", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["created_at", "2026-05-01 23:43:51.548512"], ["note", "MyText"], ["recipe_id", 980190962], ["topic", "MyString"], ["updated_at", "2026-05-01 23:43:51.548512"]]

  def destroy
    @technique_note.destroy!
---
DELETE FROM "technique_notes" WHERE "technique_notes"."id" = ?  [["id", 980190962]]

    def set_technique_note
      @technique_note = TechniqueNote.find(params.expect(:id))
---
SELECT "technique_notes".* FROM "technique_notes" WHERE "technique_notes"."id" = 1 LIMIT 1