recipe_manager/app/views/recipes/_recipe_ingredients_section.html.erb

          <td class="delete-cell">
            <%= button_to recipe_ingredient_path(recipe_ingredient), method: :delete, class: "icon-button trash-button", form: { data: { action: "submit->delete-modal#confirm", delete_modal_item_param: recipe_ingredient.ingredient.name } }, aria: { label: "Remove #{recipe_ingredient.ingredient.name} from this recipe" } do %>
---
DELETE FROM "recipe_ingredients" WHERE "recipe_ingredients"."id" = 56