recipe_manager/app/views/recipes/_steps_section.html.erb

SELECT "steps".* FROM "steps" WHERE "steps"."recipe_id" = 6 ORDER BY "steps"."order" ASC
---
          <% end %>
          <span class="step-number"><%= step.order %></span>