recipe_manager/app/views/recipes/index.html.erb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = 1
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" IN (2, 1)
---
          <dt>Ingredients</dt>
          <dd><%= recipe.recipe_ingredients.size %></dd>