recipe_manager/app/views/recipes/show.html.erb

            <div class="inline-expander-body">
              <% if substitution.substitutes.any? %>
---
SELECT "substitutes".* FROM "substitutes" WHERE "substitutes"."substitution_id" IN (15, 18, 16, 17)